# مجموع ارقام رو میخوایم رشته ورودی مثلا ایمیلی میگه اعدادش رو جمع کنیم
# ما عدد بدیم و  حدس بزنه :
# حدس عدد => عدد => کامپیوتر باید بازه ش رو محدود میکنه تا به جواب برسه 
# س : بازه رو چجوری محدود کنم ؟

# مقدمه بر جلسه بعد
# ۵ تا تایپ یاد گرفتیم
# سه تا در اینده یاد میگیریم.. ما چهار تا ساختمان داده داریم و در اصل استرینگ ها ساختمان داده نیستند چون چند طبقه نمیتونه انجام بده ینی تقریبا اوکی میکنه
# w3schools سوال از پایتون و تایپ ها رو با متد هاش میگه
# python collection(Arrays)(ارایه ها)
# 4=> ***list , set(مجموعه) , *tuple (دوتایی ها) , **dict (دیکشنری)
# list => ordered (ترتیب داشتن), changeable (قابل تغییر بودن) , duplicate number(عضو تکراری)   [](اسمش مربع به انگلیسی و براکت) l=[1,2,3]
# tuple => ordered (ترتیب داشتن) , duplicate number(عضو تکراری)   () t=(1,2,3)
# set => none   {}   s={1,2,3}
# dict => ordered (ترتیب داشتن), changeable (قابل تغییر بودن)    {}   d={'hello' : 'salam' }
# پایتون بالای 3.7 نصب کن

